results/oltp_read_only_8thr_2m/20230926-161155_ba92668e3714b3fab25a7769cba1880dd888f3c1_3.out
sysbench 1.1.0-2ca9e3f (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 8 tps: 275.46 qps: 4498.16 (r/w/o: 3939.26/0.00/558.90) lat (ms,99%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 8 tps: 308.06 qps: 4925.02 (r/w/o: 4308.89/0.00/616.13) lat (ms,99%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 8 tps: 315.00 qps: 5044.03 (r/w/o: 4414.02/0.00/630.00) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 8 tps: 319.95 qps: 5109.26 (r/w/o: 4470.35/0.00/638.91) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 8 tps: 317.02 qps: 5072.32 (r/w/o: 4437.28/0.00/635.04) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 8 tps: 324.02 qps: 5171.36 (r/w/o: 4523.32/0.00/648.05) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 8 tps: 323.00 qps: 5184.92 (r/w/o: 4538.93/0.00/645.99) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 8 tps: 323.01 qps: 5170.21 (r/w/o: 4524.18/0.00/646.03) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 8 tps: 319.99 qps: 5128.80 (r/w/o: 4488.83/0.00/639.98) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 321.99 qps: 5123.82 (r/w/o: 4479.85/0.00/643.98) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 8 tps: 316.01 qps: 5050.09 (r/w/o: 4418.08/0.00/632.01) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 8 tps: 342.03 qps: 5488.47 (r/w/o: 4804.41/0.00/684.06) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 8 tps: 357.00 qps: 5714.06 (r/w/o: 5000.05/0.00/714.01) lat (ms,99%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 8 tps: 344.97 qps: 5518.58 (r/w/o: 4828.64/0.00/689.95) lat (ms,99%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 326.02 qps: 5196.37 (r/w/o: 4544.33/0.00/652.05) lat (ms,99%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 8 tps: 319.00 qps: 5144.96 (r/w/o: 4506.97/0.00/638.00) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 8 tps: 320.99 qps: 5114.82 (r/w/o: 4472.85/0.00/641.98) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 8 tps: 322.98 qps: 5152.63 (r/w/o: 4506.68/0.00/645.95) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 8 tps: 313.97 qps: 5030.56 (r/w/o: 4402.61/0.00/627.94) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 320.04 qps: 5127.60 (r/w/o: 4487.52/0.00/640.07) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 8 tps: 313.03 qps: 5020.43 (r/w/o: 4394.37/0.00/626.05) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 8 tps: 325.98 qps: 5214.70 (r/w/o: 4562.74/0.00/651.96) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 8 tps: 339.02 qps: 5406.24 (r/w/o: 4728.21/0.00/678.03) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 8 tps: 324.00 qps: 5202.05 (r/w/o: 4554.05/0.00/648.01) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 323.95 qps: 5166.14 (r/w/o: 4518.25/0.00/647.89) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 8 tps: 322.99 qps: 5185.82 (r/w/o: 4539.84/0.00/645.98) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 8 tps: 321.06 qps: 5123.98 (r/w/o: 4481.86/0.00/642.12) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 8 tps: 320.01 qps: 5111.10 (r/w/o: 4471.09/0.00/640.01) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 8 tps: 324.99 qps: 5171.86 (r/w/o: 4521.87/0.00/649.98) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 320.01 qps: 5150.12 (r/w/o: 4510.11/0.00/640.01) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 8 tps: 320.00 qps: 5152.95 (r/w/o: 4512.95/0.00/639.99) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 8 tps: 321.00 qps: 5105.93 (r/w/o: 4463.94/0.00/641.99) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 8 tps: 316.01 qps: 5069.12 (r/w/o: 4437.10/0.00/632.01) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 8 tps: 328.00 qps: 5237.03 (r/w/o: 4581.02/0.00/656.00) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 8 tps: 322.96 qps: 5182.29 (r/w/o: 4536.38/0.00/645.91) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 8 tps: 321.01 qps: 5093.16 (r/w/o: 4451.14/0.00/642.02) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 8 tps: 325.03 qps: 5222.48 (r/w/o: 4572.42/0.00/650.06) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 8 tps: 319.00 qps: 5095.03 (r/w/o: 4457.03/0.00/638.00) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 8 tps: 337.00 qps: 5387.98 (r/w/o: 4713.98/0.00/674.00) lat (ms,99%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 332.00 qps: 5353.05 (r/w/o: 4689.04/0.00/664.01) lat (ms,99%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 8 tps: 326.00 qps: 5191.94 (r/w/o: 4539.95/0.00/651.99) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 8 tps: 319.00 qps: 5113.06 (r/w/o: 4475.05/0.00/638.01) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 8 tps: 325.00 qps: 5212.97 (r/w/o: 4562.98/0.00/650.00) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 8 tps: 322.00 qps: 5126.98 (r/w/o: 4482.99/0.00/644.00) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 8 tps: 326.00 qps: 5227.01 (r/w/o: 4575.01/0.00/652.00) lat (ms,99%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 8 tps: 317.96 qps: 5102.30 (r/w/o: 4466.39/0.00/635.91) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 8 tps: 334.00 qps: 5330.06 (r/w/o: 4662.06/0.00/668.01) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 8 tps: 329.04 qps: 5259.68 (r/w/o: 4601.60/0.00/658.09) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 8 tps: 312.99 qps: 5014.87 (r/w/o: 4388.89/0.00/625.98) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 315.01 qps: 5031.14 (r/w/o: 4401.12/0.00/630.02) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 8 tps: 339.00 qps: 5421.96 (r/w/o: 4743.96/0.00/677.99) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 8 tps: 330.00 qps: 5267.05 (r/w/o: 4607.04/0.00/660.01) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 8 tps: 339.00 qps: 5433.00 (r/w/o: 4755.00/0.00/678.00) lat (ms,99%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 8 tps: 326.99 qps: 5251.80 (r/w/o: 4597.82/0.00/653.97) lat (ms,99%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 8 tps: 350.01 qps: 5586.18 (r/w/o: 4886.16/0.00/700.02) lat (ms,99%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 8 tps: 336.96 qps: 5398.33 (r/w/o: 4724.42/0.00/673.92) lat (ms,99%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 8 tps: 325.04 qps: 5200.65 (r/w/o: 4550.57/0.00/650.08) lat (ms,99%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 8 tps: 327.99 qps: 5244.88 (r/w/o: 4588.90/0.00/655.99) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 8 tps: 318.00 qps: 5066.07 (r/w/o: 4430.06/0.00/636.01) lat (ms,99%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 324.96 qps: 5221.35 (r/w/o: 4571.43/0.00/649.92) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 8 tps: 328.04 qps: 5234.59 (r/w/o: 4578.51/0.00/656.07) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 8 tps: 324.01 qps: 5196.13 (r/w/o: 4548.12/0.00/648.02) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 8 tps: 324.92 qps: 5201.76 (r/w/o: 4551.91/0.00/649.84) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 64s ] thds: 8 tps: 320.06 qps: 5142.93 (r/w/o: 4502.81/0.00/640.12) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 8 tps: 330.02 qps: 5257.30 (r/w/o: 4597.26/0.00/660.04) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 66s ] thds: 8 tps: 319.99 qps: 5099.87 (r/w/o: 4459.89/0.00/639.98) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 67s ] thds: 8 tps: 316.00 qps: 5060.06 (r/w/o: 4428.06/0.00/632.01) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 68s ] thds: 8 tps: 322.93 qps: 5180.90 (r/w/o: 4535.04/0.00/645.86) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 69s ] thds: 8 tps: 328.06 qps: 5249.03 (r/w/o: 4592.90/0.00/656.13) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 321.00 qps: 5125.98 (r/w/o: 4483.98/0.00/642.00) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 71s ] thds: 8 tps: 319.97 qps: 5127.59 (r/w/o: 4487.64/0.00/639.95) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 72s ] thds: 8 tps: 320.03 qps: 5105.47 (r/w/o: 4465.41/0.00/640.06) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 73s ] thds: 8 tps: 316.00 qps: 5086.02 (r/w/o: 4454.02/0.00/632.00) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 74s ] thds: 8 tps: 331.95 qps: 5301.25 (r/w/o: 4637.35/0.00/663.91) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 8 tps: 329.01 qps: 5255.15 (r/w/o: 4597.13/0.00/658.02) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 76s ] thds: 8 tps: 319.04 qps: 5107.61 (r/w/o: 4469.53/0.00/638.08) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 77s ] thds: 8 tps: 326.00 qps: 5202.03 (r/w/o: 4550.03/0.00/652.00) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 78s ] thds: 8 tps: 313.00 qps: 5036.99 (r/w/o: 4410.99/0.00/626.00) lat (ms,99%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 79s ] thds: 8 tps: 332.00 qps: 5275.01 (r/w/o: 4611.01/0.00/664.00) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 315.00 qps: 5055.03 (r/w/o: 4425.03/0.00/630.00) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 81s ] thds: 8 tps: 323.00 qps: 5185.99 (r/w/o: 4539.99/0.00/646.00) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 82s ] thds: 8 tps: 327.00 qps: 5204.99 (r/w/o: 4551.00/0.00/654.00) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 83s ] thds: 8 tps: 320.00 qps: 5143.98 (r/w/o: 4503.98/0.00/640.00) lat (ms,99%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 84s ] thds: 8 tps: 309.00 qps: 4955.01 (r/w/o: 4337.01/0.00/618.00) lat (ms,99%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 8 tps: 313.00 qps: 4984.98 (r/w/o: 4358.98/0.00/626.00) lat (ms,99%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 86s ] thds: 8 tps: 327.00 qps: 5248.05 (r/w/o: 4594.04/0.00/654.01) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 87s ] thds: 8 tps: 320.00 qps: 5095.00 (r/w/o: 4455.00/0.00/640.00) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 88s ] thds: 8 tps: 316.00 qps: 5076.01 (r/w/o: 4444.01/0.00/632.00) lat (ms,99%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 89s ] thds: 8 tps: 315.00 qps: 5015.00 (r/w/o: 4386.00/0.00/629.00) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 313.00 qps: 5029.95 (r/w/o: 4402.96/0.00/626.99) lat (ms,99%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 91s ] thds: 8 tps: 319.00 qps: 5102.01 (r/w/o: 4464.01/0.00/638.00) lat (ms,99%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 92s ] thds: 8 tps: 320.97 qps: 5091.57 (r/w/o: 4449.63/0.00/641.95) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 93s ] thds: 8 tps: 331.00 qps: 5337.01 (r/w/o: 4675.01/0.00/662.00) lat (ms,99%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 94s ] thds: 8 tps: 319.02 qps: 5103.24 (r/w/o: 4465.21/0.00/638.03) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 8 tps: 317.97 qps: 5102.52 (r/w/o: 4466.58/0.00/635.94) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 96s ] thds: 8 tps: 324.03 qps: 5163.54 (r/w/o: 4515.47/0.00/648.07) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 97s ] thds: 8 tps: 321.98 qps: 5166.65 (r/w/o: 4522.70/0.00/643.96) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 98s ] thds: 8 tps: 329.00 qps: 5258.99 (r/w/o: 4600.99/0.00/658.00) lat (ms,99%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 99s ] thds: 8 tps: 329.00 qps: 5271.04 (r/w/o: 4613.03/0.00/658.00) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 349.99 qps: 5590.83 (r/w/o: 4890.85/0.00/699.98) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 101s ] thds: 8 tps: 339.02 qps: 5417.33 (r/w/o: 4739.29/0.00/678.04) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 102s ] thds: 8 tps: 322.02 qps: 5169.25 (r/w/o: 4525.22/0.00/644.03) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 103s ] thds: 8 tps: 335.00 qps: 5353.06 (r/w/o: 4683.05/0.00/670.01) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 104s ] thds: 8 tps: 319.99 qps: 5100.85 (r/w/o: 4460.87/0.00/639.98) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 8 tps: 339.98 qps: 5455.66 (r/w/o: 4775.70/0.00/679.96) lat (ms,99%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 106s ] thds: 8 tps: 337.00 qps: 5401.95 (r/w/o: 4727.96/0.00/673.99) lat (ms,99%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 107s ] thds: 8 tps: 324.03 qps: 5173.48 (r/w/o: 4525.42/0.00/648.06) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 108s ] thds: 8 tps: 318.00 qps: 5082.03 (r/w/o: 4446.02/0.00/636.00) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 109s ] thds: 8 tps: 313.00 qps: 5016.02 (r/w/o: 4390.02/0.00/626.00) lat (ms,99%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 320.00 qps: 5122.94 (r/w/o: 4482.95/0.00/639.99) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 111s ] thds: 8 tps: 320.00 qps: 5127.06 (r/w/o: 4487.05/0.00/640.01) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 112s ] thds: 8 tps: 322.97 qps: 5183.53 (r/w/o: 4537.59/0.00/645.94) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 113s ] thds: 8 tps: 319.03 qps: 5083.45 (r/w/o: 4445.40/0.00/638.06) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 114s ] thds: 8 tps: 314.99 qps: 5044.77 (r/w/o: 4414.80/0.00/629.97) lat (ms,99%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 8 tps: 322.98 qps: 5136.61 (r/w/o: 4490.66/0.00/645.95) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 116s ] thds: 8 tps: 327.04 qps: 5269.58 (r/w/o: 4615.51/0.00/654.07) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 117s ] thds: 8 tps: 323.01 qps: 5151.10 (r/w/o: 4505.09/0.00/646.01) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 118s ] thds: 8 tps: 311.96 qps: 5014.30 (r/w/o: 4390.39/0.00/623.91) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 119s ] thds: 8 tps: 327.01 qps: 5219.15 (r/w/o: 4565.13/0.00/654.02) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 312.03 qps: 4994.52 (r/w/o: 4370.45/0.00/624.06) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
Latency histogram (values are in milliseconds)
       value  ------------- distribution ------------- count
      17.633 |                                         2
      17.954 |                                         2
      18.280 |                                         5
      18.612 |                                         14
      18.950 |                                         22
      19.295 |*                                        52
      19.645 |*                                        74
      20.002 |**                                       179
      20.366 |***                                      266
      20.736 |*****                                    486
      21.112 |*********                                779
      21.496 |*************                            1168
      21.886 |******************                       1659
      22.284 |***********************                  2113
      22.689 |******************************           2748
      23.101 |************************************     3285
      23.521 |*************************************    3394
      23.948 |**************************************** 3664
      24.384 |***************************************  3529
      24.827 |************************************     3287
      25.278 |*****************************            2639
      25.737 |************************                 2163
      26.205 |*****************                        1551
      26.681 |************                             1140
      27.165 |*********                                796
      27.659 |******                                   504
      28.162 |****                                     370
      28.673 |***                                      267
      29.194 |**                                       219
      29.725 |**                                       185
      30.265 |**                                       155
      30.815 |**                                       172
      31.375 |**                                       153
      31.945 |*                                        86
      32.525 |*                                        101
      33.116 |*                                        89
      33.718 |*                                        96
      34.330 |*                                        119
      34.954 |**                                       158
      35.589 |**                                       161
      36.236 |**                                       153
      36.894 |**                                       182
      37.565 |**                                       156
      38.247 |*                                        127
      38.942 |*                                        97
      39.650 |*                                        68
      40.370 |*                                        55
      41.104 |                                         36
      41.851 |                                         27
      42.611 |                                         12
      43.385 |                                         8
      44.173 |                                         15
      44.976 |                                         12
      45.793 |                                         3
      46.625 |                                         3
      47.472 |                                         4
      48.335 |                                         4
      49.213 |                                         3
      50.107 |                                         4
      51.018 |                                         4
      51.945 |                                         2
      52.889 |                                         3
      53.850 |                                         1
      63.323 |                                         1
 
SQL statistics:
    queries performed:
        read:                            543648
        write:                           0
        other:                           77664
        total:                           621312
    transactions:                        38832  (323.54 per sec.)
    queries:                             621312 (5176.62 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      323.5389
    time elapsed:                        120.0227s
    total number of events:              38832

Latency (ms):
         min:                                   17.55
         avg:                                   24.72
         max:                                   63.17
         99th percentile:                       38.25
         sum:                               960005.73

Threads fairness:
    events (avg/stddev):           4854.0000/10.16
    execution time (avg/stddev):   120.0007/0.01